/*------------------------------------------------------
ეს არის იუზერის ობიექტი რომელიც ცარიელია და ინფოთში
შეყვანილი მონაცემების მიხედვით უნდა განვაახლო, მერე
დამჭირდება სერვერზე გასაშვებად
--------------------------------------------------------*/
export let user = {
    name: "",
    lastname: "",
    file: "",
    abuotme: "",
    email: "",
    phonenumber: "",
    userPhoto: ""

}
export let isLocal = false;
/*---------------------------------------------------------
ეს ფუნქცია არის ლოკალ სთორიჯიდან ობიექტის წამოღების და
იუზერ ობიექტში შენახვის ფუნქცია
----------------------------------------------------------*/
const localDate = localStorage.getItem("user");
if (localDate) {
  user = JSON.parse(localDate);
  isLocal = true;
  // console.log(user)
}
/*---------------------------------------------------
ეს არის იუზერის განახლების ფუნქცია, ამ ფუნქციას
გამოვიძახებ ლისენერში და იმ ინფუთის მნიშვნელობით
განახლდება იუზერი
----------------------------------------------------*/
export const update = (property, value) => {
    user[property] = value;
    localStorage.setItem("user", JSON.stringify(user));
    //console.log(user);
}


/*---------------------------------------------------------
ეს ფუნქცია ანახლებს HTML-ში ინფუთების ტექსტების მეორე
გვერდზე გადატანის ფუნქცია და რომელი გვერდის JS ფაილშიც
გამოვიძახებ, იმ გვერდზე ფოტო შენარჩუნდება რეფრეშისას
და არ წაიშლება
----------------------------------------------------------*/
export const displayy = (key, value) => {
  key.innerHTML = value;
}
/*-----------------------------------------------------
ეს ფუნქცია ანახლებს HTML-ში ფოტოს ჩარენდერების თეგს
და რომელი გვერდის JS ფაილშიც გამოვიძახებ, იმ გვერდზე
ფოტო შენარჩუნდება რეფრეშისას და არ წაიშლება
-------------------------------------------------------*/
export const displayPhoto = (key, value) => {
  key.src = value;
}
